{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "apple",
    "1": "banana",
    "10": "cucumber",
    "11": "eggplant",
    "12": "garlic",
    "13": "ginger",
    "14": "grapes",
    "15": "jalepeno",
    "16": "kiwi",
    "17": "lemon",
    "18": "lettuce",
    "19": "mango",
    "2": "beetroot",
    "20": "onion",
    "21": "orange",
    "22": "paprika",
    "23": "pear",
    "24": "peas",
    "25": "pineapple",
    "26": "pomegranate",
    "27": "potato",
    "28": "raddish",
    "29": "soy beans",
    "3": "bell pepper",
    "30": "spinach",
    "31": "sweetcorn",
    "32": "sweetpotato",
    "33": "tomato",
    "34": "turnip",
    "35": "watermelon",
    "4": "cabbage",
    "5": "capsicum",
    "6": "carrot",
    "7": "cauliflower",
    "8": "chilli pepper",
    "9": "corn"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "apple": "0",
    "banana": "1",
    "beetroot": "2",
    "bell pepper": "3",
    "cabbage": "4",
    "capsicum": "5",
    "carrot": "6",
    "cauliflower": "7",
    "chilli pepper": "8",
    "corn": "9",
    "cucumber": "10",
    "eggplant": "11",
    "garlic": "12",
    "ginger": "13",
    "grapes": "14",
    "jalepeno": "15",
    "kiwi": "16",
    "lemon": "17",
    "lettuce": "18",
    "mango": "19",
    "onion": "20",
    "orange": "21",
    "paprika": "22",
    "pear": "23",
    "peas": "24",
    "pineapple": "25",
    "pomegranate": "26",
    "potato": "27",
    "raddish": "28",
    "soy beans": "29",
    "spinach": "30",
    "sweetcorn": "31",
    "sweetpotato": "32",
    "tomato": "33",
    "turnip": "34",
    "watermelon": "35"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.39.1"
}
