id2label = {
    "0": "苹果", "1": "香蕉", "10": "黄瓜", "11": "茄子", "12": "大蒜",
    "13": "姜", "14": "葡萄", "15": "墨西哥牛角椒", "16": "猕猴桃", "17": "柠檬",
    "18": "生菜", "19": "芒果", "2": "甜菜根", "20": "洋葱", "21": "橙子",
    "22": "鲜甜椒", "23": "梨", "24": "豌豆", "25": "菠萝", "26": "石榴",
    "27": "土豆", "28": "萝卜", "29": "黄豆", "3": "彩椒",
    "30": "菠菜", "31": "甜玉米", "32": "甘薯", "33": "番茄",
    "34": "芜菁", "35": "西瓜", "4": "卷心菜", "5": "甜椒", "6": "胡萝卜",
    "7": "花椰菜", "8": "辣椒", "9": "玉米"
    }
enlabels = \
{
    "0": "apple",
    "1": "banana",
    "10": "cucumber",
    "11": "eggplant",
    "12": "garlic",
    "13": "ginger",
    "14": "grapes",
    "15": "jalepeno",
    "16": "kiwi",
    "17": "lemon",
    "18": "lettuce",
    "19": "mango",
    "2": "beetroot",
    "20": "onion",
    "21": "orange",
    "22": "paprika",
    "23": "pear",
    "24": "peas",
    "25": "pineapple",
    "26": "pomegranate",
    "27": "potato",
    "28": "raddish",
    "29": "soy beans",
    "3": "bell pepper",
    "30": "spinach",
    "31": "sweetcorn",
    "32": "sweetpotato",
    "33": "tomato",
    "34": "turnip",
    "35": "watermelon",
    "4": "cabbage",
    "5": "capsicum",
    "6": "carrot",
    "7": "cauliflower",
    "8": "chilli pepper",
    "9": "corn"
}
id2price = {
    "0": 6.0,  # 苹果
    "1": 3.0,  # 香蕉
    "10": 2.0, # 黄瓜
    "11": 3.5, # 茄子
    "12": 20.0, # 大蒜
    "13": 15.0, # 姜
    "14": 8.0,  # 葡萄
    "15": 12.0, # 墨西哥牛角椒
    "16": 15.0, # 猕猴桃
    "17": 10.0, # 柠檬
    "18": 5.0,  # 生菜
    "19": 8.0,  # 芒果
    "2": 4.0,  # 甜菜根
    "20": 2.5,  # 洋葱
    "21": 6.0,  # 橙子
    "22": 8.0,  # 鲜甜椒
    "23": 4.0,  # 梨
    "24": 10.0, # 豌豆
    "25": 6.0,  # 菠萝
    "26": 12.0, # 石榴
    "27": 3.0,  # 土豆
    "28": 3.0,  # 萝卜
    "29": 4.0,  # 黄豆
    "3": 6.0,  # 彩椒
    "30": 8.0,  # 菠菜
    "31": 6.0,  # 甜玉米
    "32": 3.5,  # 甘薯
    "33": 4.0,  # 番茄
    "34": 3.0,  # 芜菁
    "35": 2.0,  # 西瓜
    "4": 2.0,  # 卷心菜
    "5": 7.0,  # 甜椒
    "6": 3.0,  # 胡萝卜
    "7": 4.0,  # 花椰菜
    "8": 15.0, # 辣椒
    "9": 2.5   # 玉米
    }
